/*对方不想和你说话，并向你扔了一串数…… 而你必须从这一串数字中找到“250”这个高大上的感人数字。

输入格式：
输入在一行中给出不知道多少个绝对值不超过1000的整数，其中保证至少存在一个“250”。

输出格式：
在一行中输出第一次出现的“250”是对方扔过来的第几个数字（计数从1开始）。题目保证输出的数字在整型范围内。
*/
#include <stdio.h>              // 提供 scanf / printf

int main(){
    int num;                    // 存放每次读入的整数
    int i = 0;                  // 计数器：记录已读入的整数个数

    while(scanf("%d", &num) == 1){   // 关键：循环条件，只要还能读进去数字返回值就为1，就会满足条件后i++
        i++;                         // 成功读入一个数，计数 +1
        if(num == 250){              // 如果读到的数正好是 250
            printf("%d", i);         // 输出它是第几个
            break;                   // 结束循环
        }
    }
    return 0;
}
