/*据说所有程序员学习的第一个程序都是在屏幕上输出一句“Hello World”，跟这个世界打个招呼。作为天梯赛中的程序员，你写的程序得高级一点，要能跟任意指定的星球打招呼。

输入格式：
输入在第一行给出一个星球的名字S，是一个由不超过7个英文字母组成的单词，以回车结束。

输出格式：
在一行中输出Hello S，跟输入的S星球打个招呼。
*/
#include <stdio.h>
int main(){    
char name[8];    
scanf("%s",name);    
printf("Hello %s",name);    
return 0;
}
//对于char name[8],仅允许存储7个字符，最后一位要留给“\0”
//输入时，前面不需要加上&而单个字符需要加&
//=不能进行直接赋值，需要双引号“char name[8] = "Tom";”，而单个字符需要用单引号
//if(name == "Tom")               恒为假
// if(strcmp(name, "Tom") == 0)   相等返回 0
//读取时，遇到空格则只读取空格前的内容
//输出字符用%s，输出字符组用%c